Repository: JHubi1/ollama-app
Catalog: lib/l10n/app_*.arb
Languages: de, it, tr, zh

# settingsTimeoutMultiplierDescription
source: Select the multiplier that is applied to every timeout value in the app. Can be useful with a slow internet connection or a slow host.
de: Wähle den Multiplikator aus, der auf jeden Timeout-Wert in der App angewendet wird. Kann bei einer langsamen Internetverbindung oder einem langsamen Host nützlich sein.
it: Seleziona il moltiplicatore che viene applicato a ogni valore di timeout nell'applicazione. Può essere utile con una connessione internet lenta o un host lento.
tr: Uygulamadaki her zaman aşımı değerine uygulanacak çarpanı seçin. Yavaş bir internet bağlantısı veya yavaş bir ana bilgisayar ile yararlı olabilir.
zh: 选择应用程序中每个超时时间的倍数。适用于较慢的网络连接或远程主机。

# settingsTimeoutMultiplierExample
source: E.g. message timeout:
de: Z.b. Nachrichten-Timeout:
it: Es. messaggio di timeout:
tr: Örn. mesaj zaman aşımı:
zh: 例如：消息超时：

# settingsEnableHapticFeedback
source: Enable haptic feedback
de: Haptisches Feedback aktivieren
it: Abilita il feedback tattile
tr: Dokunsal geri bildirimi etkinleştir
zh: 启用触觉反馈

# settingsMaximizeOnStart
source: Start maximized
de: Maximiert starten
it: Inizzia massimizzato
tr: Başlangıçta maksimize et
zh: 最大化

# settingsBrightnessSystem
source: System
it: Sistema
tr: Sistem
zh: 系统

# settingsBrightnessLight
source: Light
de: Hell
it: Chiaro
tr: Açık
zh: 明亮

# settingsBrightnessDark
source: Dark
de: Dunkel
it: Scuro
tr: Koyu
zh: 黑暗

# settingsThemeDevice
source: Device
de: Gerät
it: Dispositivo
tr: Cihaz
zh: 设备主题

# settingsTemporaryFixes
source: Temporary interface fixes
de: Temporäre Interface Korrekturen
it: Aggiustamenti temporanei dell'interfaccia
tr: Geçici arayüz düzeltmeleri
zh: 临时界面修复

# settingsTemporaryFixesDescription
source: Enable temporary fixes for interface issues. Long press on the individual options to learn more.
de: Temporäre Korrekturen für Interface-Probleme aktivieren. Drücke lange auf die einzelnen Optionen, um mehr zu erfahren.
it: Abilita correzioni temporanee per problemi dell'interfaccia. Premi a lungo sulle opzioni individuali per saperne di più.
tr: Arayüz sorunları için geçici düzeltmeleri etkinleştirin. Daha fazla bilgi edinmek için tek tek seçeneklere uzun basın.
zh: 启用界面问题的临时修复。 长按选项以了解更多信息。

# settingsTemporaryFixesInstructions
source: Do not toggle any of these settings unless you know what you are doing! The given solutions might not work as expected. They cannot be seen as final or should be judged as such. Issues might occur.
de: Aktiviere keine dieser Einstellungen, solltest du nicht wissen, was sie machen! Die gegebene Lösung funktioniert möglicherweise nicht wie erwartet. Sie können nicht als final gesehen werden und sollten nicht als dieses bewertet werden. Probleme können auftreten.
it: Non attivare nessuna di queste impostazioni a meno che tu non sappia cosa stai facendo! Le soluzioni fornite potrebbero non funzionare come previsto. Non possono essere considerate definitive o giudicate come tali. Potrebbero verificarsi problemi.
tr: Ne yaptığınızı bilmiyorsanız bu ayarlardan herhangi birini değiştirmeyin! Verilen çözümler beklendiği gibi çalışmayabilir. Bunlar nihai olarak görülemez veya bu şekilde değerlendirilmemelidir. Sorunlar ortaya çıkabilir.
zh: 不要切换这些设置，除非你知道自己在做什么！描述的行为可能不会按照预期工作。 它们不能被视为最终结果。可能会导致一些问题。

# settingsTemporaryFixesNoFixes
source: No fixes available
de: Keine Korrekturen verfügbar
it: Nessuna correzione disponibile
tr: Herhangi bir düzeltme mevcut değil
zh: 没有可用的修复

# settingsVoicePermissionLoading
source: Loading voice permissions ...
de: Lade Sprachberechtigungen ...
it: Caricamento permessi voce ...
tr: Ses izinleri yükleniyor ...
zh: 加载语音权限...

# settingsVoiceTtsNotSupported
source: Text-to-speech not supported
de: Sprachausgabe nicht unterstützt
it: Text-to-speech non supportato
tr: Metinden sese desteklenmiyor
zh: 不支持文本转语音

# settingsVoiceTtsNotSupportedDescription
source: Text-to-speech services are not supported for the selected language. Select a different language in the language drawer to reenable them. Other services like voice recognition and AI thinking will still work as usual, but interaction might not be as fluent.
de: Sprachausgabedienste sind nicht für die ausgewählte Sprache verfügbar. Wähle eine andere Sprache im Sprachwähler, um diese wieder zu aktivieren. Andere Dienste, wie Spracherkennung und KI-Denken werden noch immer wie gewohnt funktionieren, doch die Interaktion könnte möglicherweise nicht gleich fließend sein.
it: I servizi di text-to-speech non sono supportati per la lingua selezionata. Seleziona una lingua diversa nel menu a discesa delle lingue per riattivarli. Altri servizi come il riconoscimento vocale e il pensiero dell'IA funzioneranno comunque normalmente, ma l'interazione potrebbe non essere fluida.
tr: Metinden sese hizmetleri seçilen dil için desteklenmiyor. Bunları yeniden etkinleştirmek için dil çekmecesinde farklı bir dil seçin. Ses tanıma ve yapay zeka ile düşünme gibi diğer hizmetler her zamanki gibi çalışmaya devam eder, ancak etkileşim o kadar akıcı olmayabilir.
zh: 所选的语言不支持文字转语音服务，您可能需要选择其他语言以启用该功能。 语音识别和 AI 等其他服务仍可正常工作，但交互可能无法流畅运行。

# settingsVoicePermissionNot
source: Permissions not granted
de: Berechtigungen nicht erteilt
it: Permessi non concessi
tr: İzinler verilmedi
zh: 未授予权限

# settingsVoiceNotEnabled
source: Voice mode not enabled
de: Voice Mode nicht aktiviert
it: Modalità vocale non abilitata
tr: Ses modu etkin değil
zh: 语音模式未启用

# settingsVoiceNotSupported
source: Voice mode not supported
de: Voice-Modus wird nicht unterstützt
it: Modalità vocale non supportata
tr: Ses modu desteklenmiyor
zh: 不支持语音模式

# settingsVoiceEnable
source: Enable voice mode
de: Voice-Modus aktivieren
it: Abilita modalità vocale
tr: Ses modunu etkinleştir
zh: 启用语音模式

# settingsVoiceNoLanguage
source: No language selected
de: Keine Sprache ausgewählt
it: Nessuna lingua selezionata
tr: Dil seçilmedi
zh: 未选择语言

# settingsVoiceLimitLanguage
source: Limit to selected language
de: Auf gewählte Sprache beschränken
it: Limita alla lingua selezionata
tr: Seçili dille sınırla
zh: 限制为所选语言

# settingsVoicePunctuation
source: Enable AI punctuation
de: KI Satzzeichen aktivieren
it: Abilita la punteggiatura AI
tr: Yapay zeka noktalama işaretlerini etkinleştir
zh: 启用AI标点

# settingsExportChats
source: Export chats
de: Chats exportieren
it: Esporta chats
tr: Sohbetleri dışa aktar
zh: 导出聊天记录

# settingsExportChatsSuccess
source: Chats exported successfully
de: Chats erfolgreich exportiert
it: Chat esportate con successo
tr: Sohbetler başarıyla dışa aktarıldı
zh: 聊天记录导出成功

# settingsImportChats
source: Import chats
de: Chats importieren
it: Importa chats
tr: Sohbetleri içe aktar
zh: 导入聊天记录

# settingsImportChatsTitle
source: Import
de: Importieren
it: Importa
tr: İçe Aktar
zh: 导入

# settingsImportChatsDescription
source: The following step will import the chats from the selected file. This will overwrite all currently available chats. Do you want to continue?
de: Der folgende Schritt importiert die Chats aus der ausgewählten Datei. Dadurch werden alle aktuell verfügbaren Chats überschrieben. Möchtest du fortfahren?
it: Il passaggio successivo importerà le chat dal file selezionato. Ciò sovrascriverà tutte le chat attualmente disponibili. Vuoi continuare?
tr: Sonraki adım, seçilen dosyadan sohbetleri içe aktaracaktır. Bu işlem, şu anda mevcut olan tüm sohbetlerin üzerine yazacaktır. Devam etmek istiyor musunuz?
zh: 以下步骤将从所选文件导入聊天记录。这将覆盖所有当前的聊天记录。 您要继续吗？

# settingsImportChatsImport
source: Import and Erase
de: Importieren und Löschen
it: Importa e cancella
tr: İçe Aktar ve Sil
zh: 导入并删除

# settingsImportChatsCancel
source: Cancel
de: Abbrechen
it: Annulla
tr: İptal
zh: 取消

# settingsImportChatsSuccess
source: Chats imported successfully
de: Chats erfolgreich importiert
it: Chats importate con successo
tr: Sohbetler başarıyla içe aktarıldı
zh: 聊天记录导入成功

# settingsExportInfo
source: This options allows you to export and import your chat history. This can be useful if you want to transfer your chat history to another device or backup your chat history
de: Diese Optionen ermöglichen es dir, deinen Chat-Verlauf zu exportieren und zu importieren. Dies kann nützlich sein, wenn du deinen Chat-Verlauf auf ein anderes Gerät übertragen oder deinen Chat-Verlauf sichern möchtest
it: Questa opzione ti consente di esportare e importare la cronologia chat. Questo può essere utile se desideri trasferire la cronologia chat su un altro dispositivo o eseguire il backup della cronologia chat
tr: Bu seçenekler, sohbet geçmişinizi dışa ve içe aktarmanıza olanak tanır. Bu, sohbet geçmişinizi başka bir cihaza aktarmak veya yedeklemek istediğinizde kullanışlı olabilir
zh: 这个选项允许您导出和导入您的聊天记录。如果您想将聊天记录转移到另一台设备或备份您的聊天记录，这可能会很有用。

# settingsExportWarning
source: Multiple chat histories won't be merged! You'll loose your current chat history if you import a new one
de: Mehrere Chatverläufe werden nicht zusammengeführt! Du verlierst deinen aktuellen Chatverlauf, wenn du einen neuen importierst
it: Più cronologie di chat non verranno unite! Perderai la cronologia chat attuale se ne importi una nuova
tr: Birden fazla sohbet geçmişi birleştirilmeyecek! Yeni bir sohbet geçmişi içe aktarırsanız mevcut sohbet geçmişinizi kaybedeceksiniz
zh: 多个聊天记录将不会合并！如果导入新的聊天记录，您将丢失当前的聊天记录

# settingsUpdateCheck
source: Check for updates
de: Nach Updates suchen
it: Controlla aggiornamenti
tr: Güncellemeleri kontrol et
zh: 检查更新

# settingsUpdateChecking
source: Checking for updates ...
de: Suchen nach Updates ...
it: Sto cercando aggiornamenti ...
tr: Güncellemeler kontrol ediliyor ...
zh: 检查更新中...

# settingsUpdateLatest
source: You are on the latest version
de: Du verwendest die neueste Version
it: Hai l'ultima versione
tr: En son sürümü kullanıyorsunuz
zh: 当前为最新版本

# settingsUpdateAvailable
source: Update available (v{version})
de: Update verfügbar (v{version})
it: Aggiornamento disponibile (v{version})
tr: Güncelleme mevcut (v{version})
zh: 有可用更新 (v{version})

# settingsUpdateRateLimit
source: Can't check, API rate limit exceeded
de: Kann nicht überprüfen, API-Limit
it: Impossibile verificare, limite di accesso API superato
tr: Kontrol edilemiyor, API hız sınırı aşıldı
zh: 无法检查，API使用已超过速率限制

# settingsUpdateIssue
source: An issue occurred
de: Ein Problem ist aufgetreten
it: Si è verificato un errore
tr: Bir sorun oluştu
zh: 更新服务出错

# settingsUpdateDialogTitle
source: New version available
de: Neue Version verfügbar
it: Nuova versione disponibile
tr: Yeni sürüm mevcut
zh: 有可用的新版本

# settingsUpdateDialogDescription
source: A new version of Ollama is available. Do you want to download and install it now?
de: Eine neue Version von Ollama ist verfügbar. Möchtest du sie jetzt herunterladen und installieren?
it: È disponibile una nuova versione di Ollama. Vuoi scaricarla e installarla adesso?
tr: Ollama''nın yeni bir sürümü mevcut. Şimdi indirip kurmak istiyor musunuz?
zh: Ollama有新版本可用。是否下载并安装？

# settingsUpdateChangeLog
source: Change Log
de: Versionshinweise
it: Cambiamenti
tr: Değişiklik Günlüğü
zh: 更新日志

# settingsUpdateDialogUpdate
source: Update
de: Aktualisieren
it: Aggiorna
tr: Güncelle
zh: 更新

# settingsUpdateDialogCancel
source: Cancel
de: Abbrechen
it: Annulla
tr: İptal
zh: 取消

# settingsCheckForUpdates
source: Check for updates on open
de: Beim Öffnen nach Updates suchen
it: Controlla gli aggiornamenti all'apertura
tr: Açılışta güncellemeleri kontrol et
zh: 启动时检查更新

# settingsReportIssue
source: Report Issue
de: Einen Fehler melden
it: Riporta problema
tr: Sorun Bildir
zh: 问题反馈

# settingsLicenses
source: Licenses
de: Lizenzen
it: Licenze
tr: Lisanslar
zh: 开源许可证

# settingsThemeOllama
source: Ollama
zh: Ollama主题
