Repository: JHubi1/ollama-app
Catalog: lib/l10n/app_*.arb
Languages: de, it, tr, zh

# optionNewChat
source: New Chat
de: Neuer Chat
it: Nuova Chat
tr: Yeni Sohbet
zh: 新建聊天

# optionSettings
source: Settings
de: Einstellungen
it: Impostazioni
tr: Ayarlar
zh: 设置

# optionInstallPwa
source: Install Webapp
de: Webapp installieren
it: Installa Webapp
tr: Web Uygulamasını Yükle
zh: 安装 Webapp

# optionNoChatFound
source: No chats found
de: Keine Chats gefunden
it: Nessuna Chat trovata
tr: Sohbet bulunamadı
zh: 暂无聊天消息

# tipPrefix
source: Tip:
de: Tipp:
it: Suggerimento:
tr: İpucu:
zh: 提示：

# tip0
source: Edit messages by long taping on them
de: Bearbeite Nachrichten durch langes Tippen
it: Modifica il messaggio tenendo premuto su di esso
tr: Mesajları düzenlemek için üzerlerine uzun basın
zh: 长按编辑消息

# tip1
source: Delete messages by double tapping on them
de: Lösche Nachrichten durch Doppeltippen
it: Elimina il messaggio premendo due volte su di esso
tr: Mesajları silmek için üzerlerine çift dokunun
zh: 双击删除消息

# tip2
source: You can change the theme in settings
de: Das Thema kann in den Einstellungen geändert werden
it: Puoi cambiare il tema dalle impostazioni
tr: Temayı ayarlardan değiştirebilirsiniz
zh: 您可以在设置中更改主题

# tip3
source: Select a multimodal model to input images
de: Wähle ein multimodales Modell zum Anhängen von Bildern
it: Seleziona un modello multimodale per inserire le immagini
tr: Görsel girmek için çoklu modlu bir model seçin
zh: 选择一个多模态模型来输入图像

# tip4
source: Chats are automatically saved
de: Chats werden automatisch gespeichert
it: Le chat sono state automaticamente salvate
tr: Sohbetler otomatik olarak kaydedilir
zh: 聊天记录会自动保存

# deleteChat
source: Delete
de: Löschen
it: Elimina
tr: Sil
zh: 删除

# renameChat
source: Rename
de: Umbenennen
it: Rinomina
tr: Yeniden adlandır
zh: 重命名

source: Take Image
de: Bild Aufnehmen
it: Seleziona immagine
tr: Fotoğraf Çek
zh: 拍摄图像

source: Upload Image
de: Bild Hochladen
it: Carica immagine
tr: Görsel Yükle
zh: 上传图像

source: Not a valid image
de: Kein gültiges Bild
it: Immagine non valida
tr: Geçerli bir görsel değil
zh: 不是一个有效的图片文件.

source: Image Only Conversation
de: Nur Bild Unterhaltung
it: Conversazione di sole immagini
tr: Sadece Görsel İçeren Konuşma
zh: 仅图片对话

# messageInputPlaceholder
source: Message
de: Nachricht
it: Messaggio
tr: Mesaj
zh: 消息

# tooltipAttachment
source: Add attachment
de: Anhang hinzufügen
it: Aggiungi allegato
tr: Ek ekle
zh: 添加附件

# tooltipSend
source: Send
de: Senden
it: Invia
tr: Gönder
zh: 发送

# tooltipSave
source: Save
de: Speichern
it: Salva
tr: Kaydet
zh: 保存

# tooltipLetAIThink
source: Let AI think
de: Lass KI denken
it: Lasciamo che sia IA a pensare
tr: AI''nın düşünmesine izin ver
zh: 让AI思考

# tooltipAddHostHeaders
source: Add host headers
de: Host-Header festlegen
it: Aggiungi host headers
tr: Ana bilgisayar başlıkları ekle
zh: 设置主机请求头

# tooltipReset
source: Reset current chat
de: Aktuellen Chat zurücksetzen
it: Reimposta la chat corrente
tr: Mevcut sohbeti sıfırla
zh: 重置当前聊天

# tooltipOptions
source: Show options
de: Optionen anzeigen
it: Mostra opzioni
tr: Seçenekleri göster
zh: 显示选项

source: No model selected
de: Kein Modell ausgewählt
it: Nessun modello selezionato
tr: Model seçilmedi
zh: 未选择模型

# noHostSelected
source: No host selected, open setting to set one
de: Kein Host ausgewählt, öffne zum Auswählen die Einstellungen
it: Nessun host selezionato, apri le impostazioni per farlo
tr: Ana bilgisayar seçilmedi, ayarları açıp bir tane belirleyin
zh: 没有填写主机地址，请打开设置以进行设置

# noSelectedModel
source: <selector>
de: <selektor>
it: <modelli>
tr: <seçici>
zh: <模型选择>

# newChatTitle
source: Unnamed Chat
de: Unbenannter Chat
it: Chat senza nome
tr: İsimsiz Sohbet
zh: 未命名的聊天

# modelDialogAddModel
source: Add
de: Hinzufügen
it: Aggiungi
tr: Ekle
zh: 添加

# modelDialogAddPromptTitle
source: Add new model
de: Neues Modell hinzufügen
it: Aggiungi nuovo modello
tr: Yeni model ekle
zh: 添加新模型

# modelDialogAddPromptDescription
source: This can have either be a normal name (e.g. 'llama3') or name and tag (e.g. 'llama3:70b').
de: Das kann entweder ein normaler Name (z.B. 'llama3') oder Name und Tag (z.B. 'llama3:70b') sein.
it: Questo può essere un nome normale (ad es. 'llama3') o nome e tag (ad es. 'llama3:70b').
tr: Bu normal bir isim (örneğin 'llama3') ya da isim ve etiket (örneğin 'llama3:70b') olabilir.
zh: 可以是一个普通名称(如：'llama3')，也可以是名称加标签(如：'llama3:70b')。

# modelDialogAddPromptAlreadyExists
source: Model already exists
de: Modell existiert bereits
it: Il modello esiste già
tr: Model zaten mevcut
zh: 模型已存在

# modelDialogAddPromptInvalid
source: Invalid model name
de: Ungültiger Modellname
it: Nome del modello non valido
tr: Geçersiz model adı
zh: 无效的模型名称

# modelDialogAddAllowanceTitle
source: Allow Proxy
de: Proxy erlauben
it: Abilita Proxy
tr: Proxy'e İzin Ver
zh: 允许代理服务器

# modelDialogAddAllowanceDescription
source: Ollama App must check if the entered model is valid. For that, we normally send a web request to the Ollama model list and check the status code, but because you're using the web client, we can't do that directly. Instead, the app will send the request to a different api, hosted by JHubi1, to check for us. This is a one-time request and will only be sent when you add a new model. Your IP address will be sent with the request and might be stored for up to ten minutes to prevent spamming with potential harmful intentions. If you accept, your selection will be remembered in the future; if not, nothing will be sent and the model won't be added.
de: Ollama App muss überprüfen, ob das eingegebene Modell gültig ist. Dafür senden wir normalerweise eine Webanfrage an die Ollama-Modellliste und überprüfen den Statuscode, aber da gerade der Webclient verwendet wird, können wir das nicht direkt tun. Stattdessen sendet die App die Anfrage an eine andere API, gehostet von JHubi1, um dies für uns zu überprüfen. Dies ist eine einmalige Anfrage und wird nur gesendet, wenn du ein neues Modell hinzufügst. Ihre IP-Adresse wird mit der Anfrage gesendet und kann bis zu zehn Minuten gespeichert werden, um Spamming mit potenziell schädlichen Absichten zu verhindern. Wenn du zustimmst, wird deine Auswahl für die Zukunft gespeichert; wenn nicht, wird nichts gesendet und das Modell wird nicht hinzugefügt.
it: Ollama App deve controllare se il modello inserito è valido. Per questo, normalmente inviamo una richiesta web alla lista dei modelli Ollama e controlliamo il codice di stato, ma perché stai usando il web client, non possiamo farlo direttamente. Invece, l'app invierà la richiesta a un altro api, ospitato da JHubi1, per eseguire il controllo. Questa è una richiesta verrà inviata solo quando aggiungi un nuovo modello. Il tuo indirizzo IP verrà inviato con la richiesta e potrebbe essere memorizzato per un massimo di dieci minuti per evitare lo spamming con potenziali intenzioni nocive. Se accetti, la tua selezione sarà ricordata in futuro; in caso contrario, non verrà inviato nulla e il modello non verrà aggiunto.
tr: Ollama Uygulaması, girilen modelin geçerli olup olmadığını kontrol etmelidir. Bunun için normalde Ollama model listesine bir web isteği gönderir ve durum kodunu kontrol ederiz, ancak siz web istemcisini kullandığınız için bunu doğrudan yapamayız. Bunun yerine, uygulama bizim için kontrol etmek amacıyla JHubi1 tarafından barındırılan farklı bir API'ye istek gönderecek. Bu, yalnızca bir kez yapılan bir istektir ve yalnızca yeni bir model eklediğinizde gönderilecektir. IP adresiniz istekle birlikte gönderilecek ve olası zararlı niyetlerle spam yapılmasını önlemek amacıyla on dakikaya kadar saklanabilir. Kabul ederseniz, seçiminiz gelecekte hatırlanacaktır; kabul etmezseniz, hiçbir şey gönderilmeyecek ve model eklenmeyecektir.
zh: Ollama 应用程序必须检查输入的模型是否有效。 为此，我们通常向Ollama模型列表发送一个网络请求并检查状态。 由于您正在使用 Web 客户端，我们不能直接做到这一点。 因此，应用将把请求发送到另一个由 JHubi 1 部署的api 上进行检查。 这是一个一次性请求，只有当您添加一个新模型时才会发送。 您的IP地址将与请求一起发送，可能会被存储长达10分钟，以防止潜在的有害故障。 如果您接受，您的选择将在将来被记住；如果不接受，将不会发送任何内容，也不会添加模型。

# modelDialogAddAllowanceAllow
source: Allow
de: Erlauben
it: Consenti
tr: İzin ver
zh: 允许

# modelDialogAddAllowanceDeny
source: Deny
de: Ablehnen
it: Nega
tr: Reddet
zh: 拒绝

# modelDialogAddAssuranceTitle
source: Add {model}?
de: {model} hinzufügen?
it: Aggiungi {model}?
tr: {model} Ekle?
zh: 添加{model}?

# modelDialogAddAssuranceDescription
source: Pressing 'Add' will download the model '{model}' directly from the Ollama server to your host. This can take a while depending on your internet connection. The action cannot be canceled. If the app is closed during the download, it'll resume if you enter the name into the model dialog again.
de: Durch Drücken von 'Hinzufügen' wird das Modell '{model}' direkt vom Ollama-Server auf deinen Host heruntergeladen. Je nach Internetverbindung kann dies eine Weile dauern. Der Vorgang kann nicht abgebrochen werden. Wenn die App während des Downloads geschlossen wird, wird der Download fortgesetzt, wenn du den Namen erneut in den Modelldialog eingibst.
it: Premendo 'Aggiungi' scaricherà il modello '{model}' direttamente dal server Ollama al tuo host. Questo può richiedere un po' di tempo a seconda della tua connessione internet. L'azione non può essere annullata. Se l'app è chiusa durante il download, riprenderà se inserisci di nuovo il nome nella finestra del modello.
tr: 'Ekle' tuşuna basmak, '{model}' modelini doğrudan Ollama sunucusundan bilgisayarınıza indirecektir. İnternet bağlantınıza bağlı olarak bu işlem biraz zaman alabilir. Bu işlem iptal edilemez. Uygulama indirme sırasında kapatılırsa, model adını tekrar model diyaloguna girerseniz indirme işlemi kaldığı yerden devam eder.
zh: 按下“添加”将直接从 Ollama 服务器下载模型“{model}”到您的主机。 这可能需要一些时间，取决于您的互联网连接。该操作不能被取消。 如果在下载过程中关闭应用，当您再次在模型对话框中输入名称，它将恢复之前的下载。

# modelDialogAddAssuranceAdd
source: Add
de: Hinzufügen
it: Aggiungi
tr: Ekle
zh: 添加

# modelDialogAddAssuranceCancel
source: Cancel
de: Abbrechen
it: Annulla
tr: İptal
zh: 取消

# modelDialogAddDownloadPercentLoading
source: loading progress
de: lade Fortschritt
it: Caricamento in corso
tr: yükleme ilerleme durumu
zh: 加载进度

# modelDialogAddDownloadPercent
source: download at {percent}%
de: Download bei {percent}%
it: scarica al {percent}%
tr: %{percent} oranında indir
zh: 已下载 {percent}%

# modelDialogAddDownloadFailed
source: Disconnected, try again
de: Getrennt, versuche es erneut
it: Disconnesso, riprova
tr: Bağlantı kesildi, yeniden deneyin
zh: 连接断开，请重试

# modelDialogAddDownloadSuccess
source: Download successful
de: Download erfolgreich
it: Download completato con successo
tr: İndirme tamamlandı
zh: 下载成功

# deleteDialogTitle
source: Delete Chat
de: Chat löschen
it: Elimina Chat
tr: Sohbeti Sil
zh: 删除聊天

# deleteDialogDescription
source: Are you sure you want to continue? This will wipe all memory of this chat and cannot be undone. To disable this dialog, visit the settings.
de: Bist du sicher, dass du fortfahren möchtest? Dies wird alle Erinnerungen dieses Chats löschen und kann nicht rückgängig gemacht werden. Um diesen Dialog zu deaktivieren, besuche die Einstellungen.
it: Sei sicuro di voler continuare? Tale operazione cancellerà tutta questa chat e non potrà essere annullata. Per disattivare questa finestra di dialogo, vai alle impostazioni.
tr: Devam etmek istediğinizden emin misiniz? Bu işlem, bu sohbetin tüm hafızasını silecek ve geri alınamaz. Bu dialogu devre dışı bırakmak için ayarları ziyaret edin.
zh: 您确定要继续吗？这将删除此聊天的所有记录，且无法撤消。 要禁用此对话框，请访问设置。

# deleteDialogDelete
source: Delete
de: Löschen
it: Elimina
tr: Sil
zh: 删除

# deleteDialogCancel
source: Cancel
de: Abbrechen
it: Annulla
tr: İptal
zh: 取消

# dialogEnterNewTitle
source: Enter new title
de: Gib bitte einen neuen Titel ein
it: Immetti nuovo titolo
tr: Yeni başlık girin
zh: 输入新标题

# dialogEditMessageTitle
source: Edit message
de: Nachricht bearbeiten
it: Modifica Messaggio
tr: Mesajı düzenle
zh: 编辑消息

# settingsTitleBehavior
source: Behavior
de: Verhalten
it: Comportamento
tr: Davranış
zh: 行为

# settingsDescriptionBehavior
source: Change the behavior of the AI to your liking.
de: Ändere das Verhalten der KI nach deinen Wünschen.
it: Modifica il comportamento dell'AI a tuo piacimento.
tr: Yapay zekanın davranışını istediğiniz gibi değiştirin.
zh: 根据您的喜好修改AI的行为

# settingsTitleInterface
source: Interface
de: Oberfläche
it: Interfaccia
tr: Arayüz
zh: 界面

# settingsDescriptionInterface
source: Edit how Ollama App looks and behaves.
de: Bearbeite das Aussehen und Verhalten von Ollama App.
it: Modifica l'aspetto e il comportamento dell'app Ollama.
tr: Ollama Uygulamasının görünümünü ve davranışını düzenleyin.
zh: 修改 Ollama App的外观和行为

# settingsTitleVoice
source: Voice
it: Voce
tr: Ses
zh: 语音

# settingsDescriptionVoice
source: Enable voice mode and configure voice settings.
de: Voice Mode aktivieren und Spracheinstellungen anpassen.
it: Abilita la modalità vocale e configura le impostazioni vocali.
tr: Ses modunu etkinleştirin ve ses ayarlarını yapılandırın.
zh: 启用语音模式并进行设置。

# settingsTitleExport
source: Export
de: Exportieren
it: Esporta
tr: Dışa Aktar
zh: 导出

# settingsDescriptionExport
source: Export and import your chat history.
de: Exportiere und importiere deinen Chat-Verlauf.
it: Esporta e importa la cronologia delle tue chat.
tr: Sohbet geçmişinizi dışa ve içe aktarın.
zh: 导出和导入您的聊天记录。

# settingsTitleAbout
source: About
de: Über
it: Informazioni
tr: Hakkında
zh: 关于

# settingsDescriptionAbout
source: Check for updates and learn more about Ollama App.
de: Suche nach Updates und erfahre mehr über Ollama App.
it: Controlla gli aggiornamenti e scopri di più su Ollama App.
tr: Güncellemeleri kontrol edin ve Ollama Uygulaması hakkında daha fazla bilgi edinin.
zh: 检查更新并了解更多关于Ollama App的信息。

# settingsSavedAutomatically
source: Settings are saved automatically
de: Einstellungen werden automatisch gespeichert
it: Le impostazioni vengono salvate automaticamente
tr: Ayarlar otomatik olarak kaydedilir
zh: 设置已自动保存

# settingsExperimentalAlpha
source: alpha
tr: alfa

# settingsExperimentalAlphaDescription
source: This feature is in alpha and may not work as intended or expected. Critical issues and/or permanent critical damage to device and/or used services cannot be ruled out. Use at your own risk. No liability on the part of the app author.
de: Diese Funktion befindet sich im Alpha-Status und funktioniert möglicherweise nicht wie beabsichtigt oder erwartet. Kritische Probleme und/oder dauerhafte kritische Schäden am Gerät und/oder den verwendeten Diensten können nicht ausgeschlossen werden. Benutzung auf eigene Gefahr. Keine Haftung seitens des App-Autors.
it: Questa funzionalità è in versione alpha e potrebbe non funzionare come previsto o previsto. Non si possono escludere problemi critici e/o danni critici permanenti al dispositivo e/o ai servizi utilizzati. L'utilizzo è a proprio rischio. Nessuna responsabilità da parte dell'autore dell'app.
tr: Bu özellik alfa aşamasındadır ve beklendiği gibi çalışmayabilir. Kritik sorunlar ve/veya cihaza ve/veya kullanılan hizmetlere kalıcı kritik hasar verilebilme ihtimali göz ardı edilemez. Kendi sorumluluğunuzda kullanın. Uygulama yazarının hiçbir sorumluluğu yoktur.
zh: 此功能处于 Alpha 测试阶段，可能无法按预期工作。 无法排除会对设备、服务造成严重问题或永久性重大损害。 使用需自行承担风险。应用作者不承担任何责任。

# settingsExperimentalAlphaFeature
source: Alpha feature, hold to learn more
de: Alpha-Funktion, halte, um mehr zu erfahren
it: Funzione Alpha, tieni premuto per saperne di più
tr: Alfa özelliği, daha fazla bilgi için basılı tutun
zh: Alpha功能，按住以了解更多

# settingsExperimentalBetaDescription
source: This feature is in beta and may not work intended or expected. Less severe issues may or may not occur. Damage shouldn't be critical. Use at your own risk.
de: Diese Funktion befindet sich im Beta-Test und funktioniert möglicherweise nicht wie beabsichtigt oder erwartet. Weniger schwerwiegende Probleme können auftreten oder auch nicht. Schäden sollten nicht kritisch sein. Verwendung auf eigene Gefahr.
it: Questa funzionalità è in versione beta e potrebbe non funzionare come previsto o previsto. Potrebbero verificarsi o meno problemi meno gravi. I danni non dovrebbero essere critici. Utilizza a tuo rischio e pericolo.
tr: Bu özellik beta aşamasındadır ve beklendiği gibi çalışmayabilir. Daha az ciddi sorunlar ortaya çıkabilir. Hasar kritik olmamalıdır. Kendi sorumluluğunuzda kullanın.
zh: 此功能处于 Beta 测试阶段，可能无法按预期工作。 可能会出现较轻微的问题，损害预期不严重。 使用需自行承担风险。

# settingsExperimentalBetaFeature
source: Beta feature, hold to learn more
de: Beta-Funktion, halte, um mehr zu erfahren
it: Funzione Beta, tieni premuto per saperne di più
tr: Beta özelliği, daha fazla bilgi için basılı tutun
zh: Beta测试版功能，按住以了解更多

# settingsExperimentalDeprecated
source: deprecated
de: veraltet
it: deprecato
tr: kullanım dışı
zh: 已弃用

# settingsExperimentalDeprecatedDescription
source: This feature is deprecated and will be removed in a future version. It may not work as intended or expected. Use at your own risk.
de: Diese Funktion ist veraltet und wird in einer zukünftigen Version entfernt werden. Es funktioniert möglicherweise nicht wie beabsichtigt oder erwartet. Benutzung auf eigenes Gefahr.
it: Questa funzionalità è deprecata e verrà rimossa in una versione futura. Potrebbe non funzionare come previsto o atteso. Usare a proprio rischio.
tr: Bu özellik kullanımdan kaldırılmıştır ve gelecekteki bir sürümde kaldırılacaktır. Amaçlandığı veya beklendiği gibi çalışmayabilir. Kullanım riski size aittir.
zh: 此功能已被弃用，并将在将来的版本中删除。 它可能无法像预期的那样工作。请自行承担风险。

# settingsExperimentalDeprecatedFeature
source: Deprecated feature, hold to learn more
de: Veraltete Funktion, halte, um mehr zu erfahren
it: Funzionalità deprecata, tenere premuto per saperne di più
tr: Kullanımdan kaldırılan özellik, daha fazla bilgi için bekleyin
zh: 已弃用的功能，按住以了解更多

# settingsHost
source: Host
tr: Ana bilgisayar
zh: 主机地址

# settingsHostValid
source: Valid Host
de: Gültiger Host
it: Host valido
tr: Geçerli Ana Bilgisayar
zh: 有效主机地址

# settingsHostChecking
source: Checking Host
de: Host wird Überprüft
it: Controllo Host
tr: Ana Bilgisayar Kontrol Ediliyor
zh: 正在检查主机地址

# settingsHostInvalid
source: Issue: {type, select, url{Invalid URL} host{Invalid Host} timeout{Request Failed. Server issues} ratelimit{Too many requests} other{Request Failed}}
de: Fehler: {type, select, url{Ungültige URL} host{Ungültiger Host} timeout{Request Fehlgeschlagen. Server Fehler} ratelimit{Zu viele Anfragen} other{Request Fehlgeschlagen}}
it: Problema: {type, select, url{URL invalido} host{Host invalido} timeout{Richiesta fallita. Problema col server} ratelimit{Troppe richieste} other{Richiesta fallita}}
tr: Sorun: {type, select, url{Geçersiz URL} host{Geçersiz Ana Bilgisayar} timeout{İstek Başarısız. Sunucu sorunları} ratelimit{Çok fazla istek} other{İstek Başarısız}}
zh: 问题：{type, select, url{无效的URL} host{无效的主机地址} timeout{请求失败。服务器问题} other{请求失败}}

# settingsHostHeaderTitle
source: Set host header
de: Host-Header festlegen
it: Imposta header host
tr: Ana bilgisayar başlığını ayarla
zh: 设置主机请求头

# settingsHostHeaderInvalid
source: The entered text isn't a valid header JSON object
de: Der eingegebene Text ist kein gültiges Header-JSON-Objekt
it: Il testo immesso non è un valido oggetto JSON
tr: Girilen metin geçerli bir başlık JSON nesnesi değil
zh: 输入的文本不是有效的标题 JSON 对象

# settingsHostInvalidDetailed
source: {type, select, url{The URL you entered is invalid. It isn't an a standardized URL format.} other{The host you entered is invalid. It cannot be reached. Please check the host and try again.}}
de: {type, select, url{Die eingegebene URL ist ungültig. Es handelt sich nicht um ein standardisiertes URL-Format.} other{Der eingegebene Host ist ungültig. Er kann nicht erreicht werden. Bitte überprüfe den Host und versuche es erneut.}}
it: {type, select, url{L'URL inserito non è valido. Non è un formato URL standardizzato.} other{L'host inserito non è valido. Non può essere raggiunto. Controlla l'host e riprova.}}
tr: {type, select, url{Girdiğiniz URL geçersiz. Standart bir URL formatında değil.} other{Girdiğiniz ana bilgisayar geçersiz. Ulaşılamıyor. Lütfen ana bilgisayarı kontrol edin ve tekrar deneyin.}}
zh: {type, select, url{您输入的 URL 无效。它不是一个标准的 URL 格式。} other{您输入的主机地址无效。无法连接。请检查主机地址并再试一次}}

# settingsSystemMessage
source: System message
de: Systemnachricht
it: Messaggio di sistema
tr: Sistem mesajı
zh: 系统信息

# settingsUseSystem
source: Use system message
de: Systemnachricht verwenden
it: Usa Messaggio di sistema
tr: Sistem mesajını kullan
zh: 使用系统信息

# settingsUseSystemDescription
source: Disables setting the system message above and use the one of the model instead. Can be useful for models with model files
de: Deaktiviere das Setzen der obigen Systemnachricht und benutze stattdessen die des Modells. Kann nützlich für Modelle mit Model-Files sein
it: Disabilita l'impostazione del messaggio di sistema sopra e utilizza invece quello del modello. Può essere utile per i modelli con file di modello
tr: Yukarıdaki sistem mesajını ayarlamayı devre dışı bırakır ve bunun yerine modelin mesajını kullanır. Model dosyaları olan modeller için yararlı olabilir
zh: 使用模型内嵌代替系统级别的消息。对于具有模型描述文件的模型可能会有用。

# settingsDisableMarkdown
source: Disable markdown
de: Markdown deaktivieren
it: Disabilita markdown
tr: Markdown''ı devre dışı bırak
zh: 禁用Markdown

# settingsBehaviorNotUpdatedForOlderChats
source: Behavior settings are not updated for older chats
de: Verhaltenseinstellungen werden nicht für ältere Chats aktualisiert
it: Le impostazioni sul comportamento non vengono aggiornate per le chat meno recenti
tr: Davranış ayarları eski sohbetler için güncellenmez
zh: 行为设置未针对旧聊天进行更新

# settingsShowModelTags
source: Show model tags
de: Model-Tags anzeigen
it: Visualizza tags modello
tr: Model etiketlerini göster
zh: 显示模型标签

# settingsPreloadModels
source: Preload models
de: Modelle vorladen
it: Precarica modello
tr: Ön yükleme modelleri
zh: 预加载模型

# settingsResetOnModelChange
source: Reset on model change
de: Zurücksetzen bei Modelländerung
it: Reimposta al cambio modello
tr: Model değiştiğinde sıfırla
zh: 模型更改时重置

# settingsRequestTypeStream
source: Stream
tr: Akış
zh: 流式

# settingsRequestTypeRequest
source: Request
tr: İstek
zh: 请求

# settingsGenerateTitles
source: Generate titles
de: Titel generieren
it: Genera titoli
tr: Başlıklar oluştur
zh: 生成标题

# settingsEnableEditing
source: Message editing
de: Nachrichtenbearbeitung aktivieren
it: Abilita modifica di messaggi
tr: Mesaj düzenlemeyi etkinleştir
zh: 启用消息编辑

# settingsAskBeforeDelete
source: Ask before chat deletion
de: Vor Löschung des Chats fragen
it: Chiedi prima di eliminare la chat
tr: Sohbet silmeden önce sor
zh: 删除聊天前确认

# settingsShowTips
source: Show tips in sidebar
de: Tipps in der Seitenleiste anzeigen
it: Mostra suggerimenti nella barra laterale
tr: Kenar çubuğunda ipuçlarını göster
zh: 在侧边栏显示提示

# settingsKeepModelLoadedAlways
source: Keep model always loaded
de: Modell immer geladen lassen
it: Mantieni modello sempre caricato
tr: Modeli her zaman yüklü tut
zh: 始终保持模型加载

# settingsKeepModelLoadedNever
source: Don't keep model loaded
de: Modell nicht dauerhaft laden
it: Non mantenere modello sempre caricato
tr: Modeli yüklü tutma
zh: 不保持模型加载

# settingsKeepModelLoadedFor
source: Set specific time to keep model loaded
de: Bestimmte Modell-Ladedauer festlegen
it: Imposta un tempo specifico per mantenere il modello caricato
tr: Modelin yüklü kalacağı belirli bir süre ayarla
zh: 设置模型加载的时间

# settingsKeepModelLoadedSet
source: Keep model loaded for {minutes} minutes
de: Modell für {minutes} Minuten geladen behalten
it: Mantieni modello caricato per {minutes} minuti
tr: Modeli {minutes} dakika boyunca yüklü tut
zh: 保持模型加载 {minutes} 分钟

# settingsTimeoutMultiplier
source: Timeout multiplier
de: Timeout Multiplikator
it: Moltiplicatore di timeout
tr: Zaman aşımı çarpanı
zh: 超时时间倍倍数
